In [1]:
import pandas as pd
df = pd.read_csv('salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs = df.drop('salary_more_then_100k', axis = 'columns')

In [3]:
target = df['salary_more_then_100k']

In [19]:
x = inputs
x

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [5]:
y = target
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [43]:
from sklearn.preprocessing import LabelEncoder

In [51]:
le_ex = LabelEncoder()
x = x.apply(le_ex.fit_transform)
x = x.drop(['company_n', 'job_n', 'degree_n'], axis=1)

x

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [52]:
x

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [53]:
from sklearn.model_selection import train_test_split

In [71]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size = 0.20, random_state = 1)

In [72]:
x_train

    company  job  degree
6         0    2       1
10        1    2       0
4         2    1       0
1         2    2       1
14        1    1       0
0         2    2       0
15        1    1       1
9         0    0       1
8         0    0       0
12        1    0       0
11        1    2       1
5         2    1       1

In [73]:
x_test

    company  job  degree
3         2    0       1
13        1    0       1
7         0    1       0
2         2    0       0

In [74]:
from sklearn.tree import DecisionTreeClassifier

In [75]:
pre = DecisionTreeClassifier()

In [76]:
pre.fit(x_train,y_train)

DecisionTreeClassifier()

In [84]:
pre.score(x_train,y_train)

1.0

In [85]:
pre.predict([[2,0,1]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [86]:
pre.predict([[2,2,1]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [87]:
pre.predict([[2,0,0]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [88]:
pre.predict([[1,2,0]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [89]:
pre.predict(x_test)

array([1, 1, 0, 0], dtype=int64)

In [83]:
x_test

    company  job  degree
3         2    0       1
13        1    0       1
7         0    1       0
2         2    0       0